/*Написать программу с циклом while считающую от 1 до 3 000 000 с шагом 1 и віводящая сообщение о каждой 1 000 000*/

#include <stdio.h>

int main()
{
   int x = 1;
   
   while (x <= 3000000)
   {
      if (x == 1000000)
         printf("%d\n", x);
      else if (x == 2000000)
         printf("%d\n", x);
      else if (x == 3000000)
         printf("%d\n", x);
      x++;   
   }
}
